#+title: Dynamical Memory Allocation
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> <stdlib.h> <string.h> <time.h> :results output :exports both :comments none :noweb yes
** Solution

      - Sample input:
        #+begin_src bash :results output :exports both
          echo "Cristian" > nameInput
          cat nameInput
        #+end_src

        #+RESULTS:
        : Cristian

      - Code (remove =main= and =includes= templates) v1: with =gets= (unsafe)
        #+begin_src C  :cmdline < nameInput :tangle main.c :main no :includes
          #include <stdlib.h>
          #include <stdio.h>
          int main(){
            char temp[100];
            char* name;

            printf("Enter your full name: \n");

            fgets(temp, sizeof(temp), stdin);

            name = (char *)malloc(strlen(temp) + 1);
            if(name == NULL){
              printf("Abort\n");
              exit(1);
            }

            strcpy(name, temp);
            printf("%s", name);
            free(name);

            return 0;
          }  



        #+end_src

        #+RESULTS:
        : Enter your full name: 
        : Cristian

      - Version 2: make code safer with =fgets= (see script)

** Solution:

- Code without checks if arguments were provided: source code =main.c=
  #+begin_src C :results none :tangle main2.c
    int main(int argc, char** argv){
      char* name;

      name = (char *)malloc(strlen(argv[1] + 1));
 
      strcpy(name, argv[1]);
      printf("Hello, %s!\n", name);
      free(name);

      return 0;
    }
  #+end_src

- Test:
  #+begin_src bash :results output :exports both
  gcc main2.c -o main
  ./main "Cristian Del Gobbo"
  #+end_src

  #+RESULTS:
  : Hello, Cristian Del Gobbo!

- Version 2: Code with checks if command-line arguments were provided
  (see script).

* Using dynamic storage allocation in string functions

- You can now write functions that return a pointer to a =new= string
  that didn't exist before the function was called.

- Example: concatenate two strings without changing eigher one. The C
  standard library has =strcat= but it modifies one of them:

  #+begin_src C
    char [50] = "Hello, ";
    char* two = "World";
    printf("%s\n", strcat(one, two));
  #+end_src

  #+RESULTS:
  : Hello, World

- Why does the following code not work? ("Segmentation fault")
  #+begin_src C :results silent
  char* one = "Hello, ";
  char* two = "World!";
  #+end_src

- The following =concat= function does this:

  1) measure length of the two strings to be concatenated with =strlen=

  2) call =malloc= to allocate the right amount of space

  3) copy first string into new space using =strcpy=

  4) concatenate second string using =strcat=

- Code:

  #+begin_src C :main no
    // concat: concatenate two strings
    // return: character pointer
    // params: two constants char
    char* concat(char* const str1, char* const str2){
      size_t len1 = strlen(str1);
      size_t len2 = strlen(str2);

      char* new_s = malloc(len1 + len2 + 1);

      strcpy(new_s, str1);
      strcpy(new_s, str2);

      return new_s;
    }

    int main(){
      printf("My name is %s", concat("Cristian", "Del Gobbo"));

      return 0;
    }
  #+end_src

  #+RESULTS:
  : My name is Del Gobbo

* Using =malloc= to allocate storage for an array

- To allocate an array of =n= integers where =n= is to be computed during
  run-time, we

  1) declare an integer pointer variable =int *=

  2) allocate memory with =malloc= using =sizeof(int)=

  3) initialize the array (can use pointer arithmetic)

  4) =free= the array memory when we're done using =free(3)=.

- Code:

  #+begin_src C
    #define N 5

    int* a; // demo array subscripting
    int* b; // demo pointer arithmetic
  
    a = malloc(N * sizeof(int)); // Memory block for a 5-element int array
    b = malloc(N * sizeof(int));

    // Initialize array with subscripts
    for(int i = 0; i < N; i++){
      a[i] = 1;
      printf("%d ", a[i]);
     }
  
    puts("");
    // Initialize pointer arithmetic
    for(int* p = b; p < b + N; p++){
      ,*b = 2;
      printf("%d ", *b);
     } 
  

    free(a);
    free(b);
  #+end_src

  #+RESULTS:
  : 1 1 1 1 1 
  : 2 2 2 2 2

- Sometimes, you'll also see a casting operator =(int *)= before the
  =malloc= function - because it returns a =void *= pointer by
  default. You might see this when code is shared between C and C++.

  #+begin_src C :results silent

  #+end_src

